data/raw/tektorg/tektorg_prompt2_smoke_7707083893_2026-06-15/procedures.wsdl.xml

<?xml version ='1.0' encoding ='UTF-8' ?>
<definitions targetNamespace="https://api.tektorg.ru/procedures/soap"
                  xmlns:tns="https://api.tektorg.ru/procedures/soap"
                  xmlns="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">

	<types>
		<xsd:schema targetNamespace="https://api.tektorg.ru/procedures/soap">
			<xsd:complexType name="procedures">
				<xsd:sequence>
					<xsd:element ref="tns:procedure" minOccurs="0" maxOccurs="unbounded" />
				</xsd:sequence>
			</xsd:complexType>
			<xsd:element name="exportRequestType">
              <xsd:complexType>
                  <xsd:all>
                      <xsd:element name="startDate" type="xsd:dateTime" minOccurs="0" maxOccurs="1"/>
                      <xsd:element name="endDate" type="xsd:dateTime" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="startUpdateAt" type="xsd:dateTime" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="endUpdateAt" type="xsd:dateTime" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="sectionCode" type="xsd:string" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="registryNumber" type="xsd:string" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="eisRegistryNumber" type="xsd:string" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="typeId" type="xsd:int" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="organizerINN" type="xsd:string" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="customerINN" type="xsd:string" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="limitPage" type="xsd:int" minOccurs="0" maxOccurs="1"/>
					  <xsd:element name="sort" type="tns:sortRules" minOccurs="0" maxOccurs="1" />
					  <xsd:element name="page" type="xsd:int" minOccurs="0" maxOccurs="1"/>
                  </xsd:all>
              </xsd:complexType>
           </xsd:element>
			<xsd:element name="procedure">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element type="xsd:int" name="remoteId"/>
						<xsd:element type="xsd:string" name="url_to_showcase" />
						<xsd:element type="xsd:string" name="registryNumber" minOccurs="0"/>
						<xsd:element type="xsd:string" name="eisRegistryNumber" minOccurs="0"/>
						<xsd:element type="xsd:string" name="title"/>
						<xsd:element type="xsd:dateTime" name="datePublished"/>
						<xsd:element type="xsd:dateTime" name="dateUpdated"/>
						<xsd:element type="xsd:dateTime" name="dateRegistrationTech" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndRegistration" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndSecondPartsReview" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndPrequalification" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateBeginAuction" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndAuction" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateArchived" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="clarificationStartDate" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="clarificationEndDate" minOccurs="0"/>
						<xsd:element type="xsd:string" name="clarificationDeliveryProcedure" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndRegistrationTech" minOccurs="0"/>
						<xsd:element type="xsd:dateTime" name="dateEndRegistrationCom" minOccurs="0"/>
						<xsd:element name="procedureType" type="tns:proceduretypeType"/>
						<xsd:element type="xsd:string" name="contactEmail" minOccurs="0"/>
						<xsd:element type="xsd:string" name="contactPhone" minOccurs="0"/>
						<xsd:element type="xsd:string" name="contactPerson" minOccurs="0"/>
						<xsd:element type="xsd:string" name="companyStructureName" minOccurs="0"/>
						<xsd:element type="xsd:string" name="reviewApplicsCity" minOccurs="0"/>
						<xsd:element type="xsd:string" name="currency" minOccurs="0"/>
						<xsd:element name="organizer" type='tns:organizationType'/>
						<xsd:element name="documents" type='tns:documentsType' minOccurs="0"/>
						<xsd:element name="lots">
							<xsd:complexType>
								<xsd:sequence>
									<xsd:element name="lot" maxOccurs="unbounded">
										<xsd:complexType>
											<xsd:sequence>
												<xsd:element type="xsd:int" name="remoteId"/>
												<xsd:element type="xsd:int" name="number"/>
												<xsd:element type="xsd:string" name="subject"/>
												<xsd:element type="xsd:float" name="startPrice"  minOccurs="0"/>
												<xsd:element type="xsd:string" name="status"/>
												<xsd:element type="xsd:string" name="nds"  minOccurs="0"/>
												<xsd:element type="xsd:float" name="startPriceNoNds"  minOccurs="0"/>
												<xsd:element type='xsd:boolean' name="startPriceUndefined" minOccurs="0"/>
												<xsd:element type="xsd:boolean" name="alternativeApplics"  minOccurs="0"/>
												<xsd:element name="customers" type="tns:customersType"  minOccurs="0" />
												<xsd:element name="lotOkved" type="tns:lotOkvedsType"  minOccurs="0"/>
												<xsd:element name="lotOkved2" type="tns:lotOkvedsType"  minOccurs="0"/>
												<xsd:element name="deliveryPlaces" type='tns:deliveryplacesType' minOccurs="0"/>
												<xsd:element name="nomenclature" type="tns:nomenclatureType" minOccurs="0"/>
												<xsd:element name="nomenclature2" type="tns:nomenclatureType" minOccurs="0"/>
												<xsd:element name="lotUnits" type="tns:lotUnitsType" minOccurs="0" />
												<xsd:element name="documents" type='tns:documentsType' minOccurs="0"/>
											</xsd:sequence>
											<xsd:attribute type="xsd:int" name="id"/>
										</xsd:complexType>
									</xsd:element>
								</xsd:sequence>
							</xsd:complexType>
						</xsd:element>
					</xsd:sequence>
					<xsd:attribute type="xsd:int" name="id"/>
				</xsd:complexType>
			</xsd:element>
			<xsd:complexType name="addressType">
				<xsd:sequence>
					<xsd:element type="xsd:string" name="index"/>
					<xsd:element type="xsd:string" name="region"/>
					<xsd:element type="xsd:string" name="settlement" minOccurs="0"/>
					<xsd:element type="xsd:string" name="city"/>
					<xsd:element type="xsd:string" name="street"/>
					<xsd:element type="xsd:string" name="house"/>
					<xsd:element type="xsd:string" name="countryIsoNr"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="organizationType">
				<xsd:sequence>
					<xsd:element type="xsd:int" name="id"/>
					<xsd:element type="xsd:string" name="fullName"/>
					<xsd:element type="xsd:string" name="inn"/>
					<xsd:element type="tns:addressType" name="legal"/>
					<xsd:element type="tns:addressType" name="postal"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="customerOrganizationType">
				<xsd:sequence>
					<xsd:element type="xsd:int" name="id"/>
					<xsd:element type="xsd:string" name="fullName" minOccurs="0"/>
					<xsd:element type="xsd:string" name="inn" minOccurs="0"/>
					<xsd:element type="xsd:string" name="phone"  minOccurs="0"/>
					<xsd:element type="xsd:string" name="email"  minOccurs="0"/>
					<xsd:element type="tns:addressType" name="legal"  minOccurs="0"/>
					<xsd:element type="tns:addressType" name="postal"  minOccurs="0"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="customersType">
				<xsd:sequence>
					<xsd:element name="customer" type='tns:customerOrganizationType'  maxOccurs="unbounded"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="documentsType">
				<xsd:sequence>
					<xsd:element name="document" type='tns:documentType'  maxOccurs="unbounded"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="documentType">
				<xsd:sequence>
					<xsd:element name="id" type="xsd:int"  minOccurs="1"/>
					<xsd:element name="filename" type="xsd:string"  minOccurs="1"/>
					<xsd:choice>
						<xsd:element name="removed" type="xsd:boolean"/>
						<xsd:element name="file" type="xsd:string"/>
					</xsd:choice>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="lotOkvedsType">
				<xsd:sequence>
					<xsd:element name="okved_code" type="tns:lotOkvedType" minOccurs="1" maxOccurs="unbounded"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="lotOkvedType">
				<xsd:sequence>
					<xsd:element type="xsd:string" name="code"/>
					<xsd:element type="xsd:string" name="name"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="nomenclatureType">
				<xsd:sequence>
					<xsd:element name="item"  maxOccurs="unbounded">
						<xsd:complexType>
							<xsd:sequence>
								<xsd:element type="xsd:string" name="code"/>
								<xsd:element type="xsd:string" name="name"/>
							</xsd:sequence>
						</xsd:complexType>
					</xsd:element>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="lotUnitsType">
				<xsd:sequence>
					<xsd:element name="unit"  maxOccurs="unbounded">
						<xsd:complexType>
							<xsd:sequence>
								<xsd:element type="xsd:string" name="name"/>
								<xsd:element type="xsd:string" name="okeiCode"/>
								<xsd:element type="xsd:string" name="okpd2_code"/>
								<xsd:element type="xsd:string" name="okved2_code"/>
								<xsd:element type="xsd:string" name="quantity"/>
							</xsd:sequence>
						</xsd:complexType>
					</xsd:element>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="okeicodesType">
				<xsd:sequence>
					<xsd:element name="item"  maxOccurs="unbounded">
						<xsd:complexType>
							<xsd:sequence>
								<xsd:element type="xsd:short" name="code"/>
								<xsd:element type="xsd:string" name="name"/>
							</xsd:sequence>
						</xsd:complexType>
					</xsd:element>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="deliveryplacesType">
				<xsd:sequence>
					<xsd:element name="deliveryPlace" type="tns:deliveryplaceType" minOccurs="0" maxOccurs="unbounded"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="deliveryplaceType">
				<xsd:sequence>
					<xsd:element type="xsd:string" name="quantity" minOccurs="0"/>
					<xsd:element type="xsd:string" name="term" minOccurs="0"/>
					<xsd:element type="xsd:string" name="okeiCode" minOccurs="0"/>
					<xsd:element type="xsd:string" name="address" minOccurs="0"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="proceduretypeType">
				<xsd:sequence>
					<xsd:element type="xsd:int" name="id"/>
					<xsd:element type="xsd:string" name="title"/>
				</xsd:sequence>
			</xsd:complexType>
			<xsd:complexType name="sortRules">
				<xsd:sequence>
					<xsd:element type="xsd:string" name="field" minOccurs="1"/>
					<xsd:element type="xsd:string" name="operator" minOccurs="1"/>
				</xsd:sequence>
			</xsd:complexType>
		</xsd:schema>
	</types>

	<message name="proceduresRequest">
		<part name="symbol" element="tns:exportRequestType"/>
	</message>
	<message name="proceduresResponse">
		<part name="totalProcedures" type="xsd:int"/>
		<part name="currentPage" type="xsd:int"/>
		<part name="totalPage" type="xsd:int"/>
		<part name="limitProceduresInPage" type="xsd:int"/>
		<part name="sectionName" type="xsd:string"/>
		<part name="sectionCode" type="xsd:string"/>
		<part name="procedures" type="tns:procedures"/>
	</message>

	<portType name="exportProcedurePort">
		<operation name="procedures">
			<input message="tns:proceduresRequest"/>
			<output message="tns:proceduresResponse"/>
		</operation>
	</portType>

	<binding name="exportProcedureBinding" type="tns:exportProcedurePort">
		<soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="procedures">
			<soap:operation soapAction="urn:procedures" style="rpc"/>
			<input>
				<soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
			</input>
			<output>
				<soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
			</output>
		</operation>
	</binding>

	<service name="exportProcedureService">
		<port name="exportProcedurePort" binding="tns:exportProcedureBinding">
			<soap:address location="https://api.tektorg.ru/procedures/soap"/>
		</port>
	</service>
</definitions>
