data/raw/tektorg/tektorg_prompt2_full_scope_2026-06-15/ооо-инстамарт-технолоджис-купер_organizerINN_page_1_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://api.tektorg.ru/procedures/soap">
  <SOAP-ENV:Body>
    <tns:procedures>
      <symbol xsi:type="tns:exportRequestType">
        <startDate xsi:type="xsd:dateTime">2024-01-01T00:00:00+05:00</startDate>
        <endDate xsi:type="xsd:dateTime">2025-12-31T23:59:59+05:00</endDate>
        <organizerINN xsi:type="xsd:string">9705118150</organizerINN>
        <limitPage xsi:type="xsd:int">100</limitPage>
        <page xsi:type="xsd:int">1</page>
      </symbol>
    </tns:procedures>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>